{"version":"https://jsonfeed.org/version/1.1","title":"Star`s Note","home_page_url":"https://star-du.github.io/eleventy-blog/","feed_url":"https://star-du.github.io/eleventy-blog/full.json","description":"A place for writing and reading.","user_comment":"Star`s Note JSON feed (full articles)","authors":[{"name":"star-du","url":"https://github.com/star-du"}],"language":"en","icon":"https://star-du.github.io/eleventy-blog/icon-192.png","favicon":"https://star-du.github.io/eleventy-blog/icon-512.png","items":[{"id":"https://star-du.github.io/eleventy-blog/wikipedia-learnings/","url":"https://star-du.github.io/eleventy-blog/wikipedia-learnings/","title":"人人可编辑的 Wikipedia","date_published":"2024-11-09T00:00:00Z","language":"","content_html":"&lt;p&gt;好久不更新博客！来一篇简要的分享，正是时候。&lt;/p&gt;&lt;p&gt;虽然使用 Wikipedia 的年头很久了，但亲自参与这件事一直处于设想之外，胆怯有之，待在舒适圈的想法也很强烈。去年年初时终于注册了一个自己的账号，而到最近才开始去学习这个平台的基础知识，尤其是“怎么样开始编辑”。&lt;/p&gt;&lt;p&gt;抛开主体内容不谈，我在读维基百科&lt;a href=&quot;https://en.wikipedia.org/wiki/Help:Introduction_to_referencing_with_VisualEditor/1&quot;&gt;关于引用的帮助（教程）页面&lt;/a&gt;时，发现它对可靠信源的处理方式「挺有意思的」。相比原始文献，二手来源的资料永远是更佳之选。选用学术文章时，同行评议和引用数是重要标准，而近来十分流行的预发表平台文章（preprint，如 &lt;a href=&quot;https://en.wikipedia.org/wiki/ArXiv&quot;&gt;arXiv&lt;/a&gt;）则最好不选。个中原因，自有&lt;a href=&quot;https://en.wikipedia.org/wiki/Wikipedia:Reliable_sources#Scholarship&quot;&gt;专门的一页&lt;/a&gt;记录，这里面的考量和其「视角中立」「不采纳原创研究」的内容政策相关。&lt;/p&gt;&lt;p&gt;仔细看这篇教程，可学到不少新闻学的概念。美联社、AFP 和路透社等都是 news agency（通讯社），它们负责收集新闻报道，而打包出售给订阅它们的报纸、杂志、广播电台等新闻组织。Churnalism 是源自英国记者的一种形容，是说如今各种预先制作好的新闻素材越来越多（例如，组织发布的 press release），媒体更少进行原创的新闻报道，而只是对原始材料进行少量修改。&lt;/p&gt;&lt;p&gt;如果点开里面的链接进一步探索，发现有页面列出&lt;a href=&quot;https://en.wikipedia.org/wiki/Wikipedia:What_Wikipedia_is_not&quot;&gt;维基百科不是什么&lt;/a&gt;，还有详细记载&lt;a href=&quot;https://en.wikipedia.org/wiki/Wikipedia:Reliable_sources/Perennial_sources&quot;&gt;经常讨论的一些信源的基础共识&lt;/a&gt;。如果感兴趣，可以看到新华社目前处于何种状态。&lt;/p&gt;&lt;p&gt;读完教程，彩蛋则是关于 &lt;a href=&quot;https://en.wikipedia.org/wiki/Help:Introduction_to_referencing_with_VisualEditor/reliable_sources_quiz&quot;&gt;信源可靠度的小测验&lt;/a&gt;，我自己觉得不妨一做，乐在其中。&lt;/p&gt;"},{"id":"https://star-du.github.io/eleventy-blog/japan-2024-vol-1/","url":"https://star-du.github.io/eleventy-blog/japan-2024-vol-1/","title":"日本旅行记：一","date_published":"2024-06-14T00:00:00Z","language":"","content_html":"&lt;h3 id=&quot;&quot;&gt;缘起&lt;/h3&gt;&lt;p&gt;最近非常喜欢翻詹宏志《旅行与读书》，里面作者自嘲是书呆子在旅途，因为爱读书而给旅行添加很多滋味，让我跟着他“二手旅行”都如看小说般津津有味。看别人的书看得手痒，在博客里&lt;a href=&quot;https://star-du.github.io/eleventy-blog/tag/book-review/&quot;&gt;写过这么多书评&lt;/a&gt; 过后，我也有意写点文章，分享最近一次日本之旅的点滴。&lt;/p&gt;&lt;p&gt;写之前，我恰好看过椒盐豆豉的&lt;a href=&quot;https://blog.douchi.space/japan-2023/#gsc.tab=0&quot;&gt;日本旅行 photo dump&lt;/a&gt;，正如标题所言，分享的照片不少，也穿插着简要的文字；而我决定写得稍微不一样些。我想连载好几篇文章，每篇自由去尝试不一样的角度和形式。这次的第一篇，就先从旅途最后到达的和歌山（Wakayama）开始吧。&lt;/p&gt;&lt;h3 id=&quot;-1&quot;&gt;和歌山县与和歌山市&lt;/h3&gt;&lt;p&gt;这次和朋友在关西一共旅行九日，先从大阪关西机场落地，在大阪度过周末；然后在京都相对从容的呆了五天，最后在和歌山居停两天，结束旅程。&lt;/p&gt;&lt;p&gt;与中国省、县、乡的三级行政区划不同（大家常说的“地级”，其实&lt;a href=&quot;https://zh.wikipedia.org/wiki/%E4%B8%AD%E5%8D%8E%E4%BA%BA%E6%B0%91%E5%85%B1%E5%92%8C%E5%9B%BD%E8%A1%8C%E6%94%BF%E5%8C%BA%E5%88%92&quot;&gt;不在宪法规定之列&lt;/a&gt;），日本只有两个层级，一级行政区为&lt;a href=&quot;https://zh.wikipedia.org/wiki/%E9%83%BD%E9%81%93%E5%BA%9C%E7%B8%A3&quot;&gt;都道府县&lt;/a&gt;，二级就是市、町、村。日本的一级（省级）行政单位有 47 个之多，其中只有东京一个都，北海道一地为“道”，再加上大阪府、京都府，其余都是县。所以，更精确地说，我们造访的是和歌山县的首府和歌山市，这个叫法不加解释，可能让中文背景的读者不太习惯。&lt;/p&gt;&lt;h3 id=&quot;-2&quot;&gt;想象与见闻&lt;/h3&gt;&lt;p&gt;来之前我试图想象过和歌山的样貌。&lt;/p&gt;&lt;p&gt;一起旅行的朋友说，想去看看“日本城市的平均水平”，我觉得这和我的期待是差不多的。东京当然是 Mega-City ，在日本独一无二，大阪和京都也是一两百万人的城市，又是观光重镇。而和歌山呢，我随身携带的孤独星球都没有列出专门的条目，只有简短几页献给和歌山（县）坐拥古道和寺庙的高野山，以及海边的白滨。于是我索性带一点“空杯”心态，刻意没有做什么功课，就乘“南海電鉄”到达和歌山市站。&lt;/p&gt;&lt;p&gt;到达的那天下午，天不算很晴朗，能看到近处河流呈现江水般的灰色，眺望不到远处的海。我们选择的酒店就建在车站建筑里，通往大堂的电梯入口离站台出入口几乎是抬腿可达的距离，这在之前的经验里是从没见过的。酒店颜色很低调，看起来也有干净而优雅的气质。进入房间放置行李，才发现沿窗边铺有软垫的飘窗坐下，除了河流与城市尽收眼底，居然还可以看到铁道和上下车的月台：偶尔听到叮铃铃的列车运行声，看到各种涂装的车厢经过，让并非硬核铁道迷的我都觉得有趣。&lt;/p&gt;&lt;p&gt;大家肚子空空，于是在车站附近，也就是酒店步行可达的“五分钟生活圈”，享受“分布式”美食拼盘：章鱼小丸子、咖啡店的烤香肠和含酒精冰淇淋、和歌山本地的和牛烤肉、最后还吃到了看起来就很健康的蒸蔬菜拼配蒸海鲜；如此肚皮鼓鼓准备回酒店，发现楼下还有家 Kitano Ace（汉字应该写作北野）的食品超市。便利店虽好，但这种精品超市帮我搜罗本土常见和不常见的物产商品，对我实在太有吸引力。留连很久，又买了鲜奶、牛油果和本地咖啡店做的 Vegan Cookie 才欣然离去。就这么一路从五点吃到了八点，这真的是“小城市”也能享受到的丰富吗？&lt;/p&gt;&lt;p&gt;回到房间，发现酒店有自己的私家浴场 —— 那看起来是一定要去拜访的了。这家名为 Sky Spa 的顶楼浴场，进入时就感觉干净、保养得当。虽然占地并不大，但室内的部分已经有采光通透的大玻璃，可以边泡澡边欣赏外面的夜色；还有一半的浴池在室外，仿佛在邀请着我们务必去看看。&lt;/p&gt;&lt;p&gt;在室内暖过身子之后，我推开玻璃隔门，走入户外的天地。哇，顶楼的风吹过，带一丝暮春初夏的凉意，我赶忙把身子放入热意腾腾的水里，以便细细看眼前没有太多遮挡的风景。远处楼宇、河流、夜间的工厂，不是繁华但也不是荒凉，只能说是安静；再抬头，还能看到云朵和星星（在第二个更晴朗的夜晚，我仰卧着看天上的北斗七星，清晰而明亮，望得出神）。泡温泉的都是酒店的住客，人不太多，大家各自分散占据一角，偶尔调整出水的姿势，全部沉浸在一种物理性的放松和享受之中。大楼下正是车站，偶尔来往的列车传来声响，但却更衬出一种宁静的氛围，即使朋友之间说话，好像也不能打破这份夜晚和温泉赐予的声场。&lt;/p&gt;&lt;p&gt;体验过这样的场面之后，我才有些懂得日本人为何对室外温泉情有独钟。自然很近、又带着对人类的温存，实在让人沉浸。&lt;/p&gt;&lt;p&gt;泡过澡，还有桑拿房可供选择，但我们体力不支，就只是擦洗过身体，换上酒店提供的睡衣，在室内休息区坐下。休息室一角贴心的放了自动售卖机，里面的冰饮和冰啤酒与泡过澡身体的微微发烫实在太契合了，坐在沙发上闲聊，旁边就是转角的大片玻璃，外面和歌山市的灯光和夜光荧荧发亮，简直如同漫画的场面。&lt;/p&gt;&lt;hr /&gt;&lt;p&gt;那和歌山到底是怎样的呢？&lt;/p&gt;&lt;p&gt;第二天一早，窗外天气晴朗，前一天还不起眼的河流一下子变成深蓝色，几乎与海占据调色盘相同位置，我们又去楼下的咖啡厅吃早午饭（日本的西餐简餐几乎都做得很好），再端一杯市民图书馆/茑屋书店里的星巴克，步行踏上城市的街道。&lt;/p&gt;&lt;p&gt;人真少啊。干净的马路上稀稀疏疏几辆车，路上也不太碰得到同向而行的行人。我们昨晚在和歌山站吃饭，餐厅选择不少，但每一家人都不太多，以周五晚上的标准看就更是如此；当时就生出疑问，和歌山的人都去哪儿了呢？Where’s everyone？今天走在路上，这种好奇好像只是加深了。&lt;/p&gt;&lt;p&gt;从车站到和歌山城，也只是二十分钟的脚程，随指引慢慢绕上山，发现是标准的日式城堡的样式——周围一圈护城河，中间耸立一个多层楼阁、有飞檐的建筑，只是一律是灰白配色。我上次去大阪天守阁大概也是这个印象。不过毕竟居于高处，今天天气又好，登城爬山也不错。&lt;/p&gt;&lt;p&gt;在城楼上鸟瞰一番和歌山市，大概是对回答我的问题的最直观答案。从城堡最高处望出去，四面其实都是鳞次的建筑，河对岸也有工厂，可见的范围内没有大片的空地，看来还是高度城市化的地方，并非乡村或小镇。天公作美之下，如此眺望一番，也让人心旷神怡。&lt;/p&gt;&lt;p&gt;从城堡下来，我们到一处称为“红松庵”的小庭园稍坐、喝茶，园子是本市出身的工业巨子松下幸之助赠予的，坐在席前喝浓浓的抹茶、吃点心时，还能因此稍稍神游。茶室不远有一小片空地，属于城堡所在的市民公园的一部分，空地上乐手在台前弹唱，也有些搭帐篷的摊位吸引着本地居民的聚集，相比路上所见，算是热闹了；但比之前几天京都东寺的弘法集市，则规模小得多，人也只是零头。&lt;/p&gt;&lt;p&gt;从和歌山城出来，下一站想去海边。我们没经过太多功课，选定和歌浦的片男波海水浴场。从公交车下来，没经过太远就看见眼前干净的沙滩，海水清澈而微蓝，也零星有游人在沙滩边或坐或躺、或下海玩水，岸边伸出的一段平台还有人在海钓。在眼下还可以称得上凉爽的时节，天空和海面都只涂抹浅浅的蓝色，但沙子细腻而又干净，可以让人尽情在海边眺望，与海亲近。&lt;/p&gt;&lt;p&gt;沙滩边的车位空出很多，旁边留有成片可以摆摊的区域，可以想象在旺季会是泳衣、冰淇淋贩卖的好地方，只不过眼下是宁静的淡季了。这片宁静此刻倒是正好。&lt;/p&gt;&lt;p&gt;回程时我们专门坐上去 JR 和歌山站的车，这次车上的人终于稍多一点了，开始有人在车里站着。这个车站被两个铁道系统共用，年头更长，周边看起来也许生活气息更浓一点，但和我们住的那边没有根本性的气质差异。车站边的近铁百货大楼，已经是六点下班时间，但楼顶几家餐馆又都是“看着就很好吃”的样子。选了一家店大快朵颐后，我们坐电车只消十几分钟，就回到和歌山市站，还能在泡澡前享受一遍逛超市和书店翻阅杂志的快乐。&lt;/p&gt;&lt;h3 id=&quot;-3&quot;&gt;问题的答案&lt;/h3&gt;&lt;p&gt;拉杂一大通之后，我发现最早提出的那个问题是有一个很显然的答案的。和歌山市就是一个人口三十多万的安静城市，是地区首府，也有山有海，但除开去关西机场也很方便外，并不至于对一般的海外观光客有多强的吸引力。（高野山可能有吸引人去行走熊野古道或参拜寺庙的更独特魅力，但从和歌山市出发也要坐两小时以上的火车）。&lt;/p&gt;&lt;p&gt;但两天下来，我在这里体验到的放松感，还是很生动地印在脑海里。国内的海岸线上当然有绝不逊色的自然景观，也可以找到同样人少的小城，但我很难预期有类似发达的公共交通，带我来往机场和所在区域的中心城市（从和歌山市到机场只要四十分钟，到大阪市中心的难波，坐南海特急只要一个小时）；车站边的超市和餐厅，还有那个漂亮的市民图书馆，让我觉得如果不偏爱热闹，这里的城市生活也足够方便了，好像苏州的邻里中心一样，可以满足工作日的各种需求；还有日本式的干净、整洁与礼貌。&lt;/p&gt;&lt;p&gt;作为旅行者去想象这样的生活，无法避免会是浪漫化的。归根结底，我是带着一颗游客的心态在此宿留的，不用考虑日日的生活琐碎与压力，这样的城市形态能否在少子化、老龄化的未来原样持续下去，也更毋庸我费心。但我后来意识到，这个不太观光化的宁静之地能让我记住，正因为它让我浅尝了一段很不一样的城市生活，在习惯于挤在数百万、上千万人口的中国城市之后，我才发现：原来在乡村和繁华都市的两极之间，还有更为丰富的城市光谱，可以作为有吸引力的居住选项。Wakayama 这样的城市也蛮舒服的，不是吗？&lt;/p&gt;&lt;img src=&quot;https://star-du.github.io/images/wakayama-shi.jpeg&quot; class=&quot;book_image&quot; /&gt;&lt;p&gt;文中提及的车站进站口就在 &lt;em&gt;和歌山市駅&lt;/em&gt; 几个字的正下方，茑屋书店和星巴克在市民图书馆一楼，进站口左边就是药妆店、北野食品超市和选择不少的餐厅。图中还可以看到我们的酒店。&lt;/p&gt;"},{"id":"https://star-du.github.io/eleventy-blog/finite-and-infinite-games/","url":"https://star-du.github.io/eleventy-blog/finite-and-infinite-games/","title":"《游戏》札记","date_published":"2024-06-08T00:00:00Z","language":"","content_html":"&lt;p&gt;对我而言，James P. Carse 的《有限与无限的游戏》（原书名 &lt;em&gt;Finite and Infinite Games: A Vision of Life as Play and Possibility&lt;/em&gt;）是一本启示之书。&lt;/p&gt;&lt;h3 id=&quot;&quot;&gt;一&lt;/h3&gt;&lt;p&gt;跟随书页，用“游戏”的视角看待习以为常的风景，而且是带着哲学式的朴素和精准，这个过程不光是给我带来启迪，也让我不断体验认识刷新、心智冒险的兴奋和乐趣。&lt;/p&gt;&lt;p&gt;不过，我也开始回想，以我阅读人文社科文本的经验来看，这算是杰出作品的共性吗？只就最近来说，阅读 &lt;em&gt;Two cheers for anarchism&lt;/em&gt; 和齐格蒙特·鲍曼的《社会学之思》，都让我有过类似的体验。但不管怎样，与托翁的那句名言不同，幸福的家庭或许相似，杰出的作品总是各有各的不同。这本书是冥想的文本，最适宜读者跟着它一起沉思，所以文字很干净，不会讲那么多故事、也不去引述成体系的理论 —— 即使文字间零星会出现被引用的话，但不论原来说话的人带着怎样的语境，在这部作品里都好像在为作者的“游戏”世界观发声，成为其中的有机组分。&lt;/p&gt;&lt;p&gt;这样的文本看起来简单，想要引人入胜却难度十足。为了带读者诸君一窥原著的世界，我想先引用一段原文如下：&lt;/p&gt;&lt;div class=&quot;chinese_italic&quot;&gt;&lt;p&gt;文化则是无限的游戏。文化无边界，在一个文化中，所有人都能成为参与者，无论任何时间任何地点。&lt;/p&gt;&lt;p&gt;因为一个社会精心保持着时间边界，所以它将自己的过去理解为一种宿命，或天命。也就是说，它的历史轨道有明确的起点（某个社会的创立者总是特别得到纪念），以及明确的终点（它的成功性质重复体现在比如“各尽所能，按劳分配”这样的官方口号中）。&lt;/p&gt;&lt;p&gt;因为文化没有时间边界，所以文化并不将它的过去理解为宿命，而是视为历史，也即一种已经开始但永远指向无穷开放性的叙事。文化是人类的事业，拒绝使自己免于惊讶。生活在这样有力量的图景中，他们便避开权力，喜悦地做着各种拓展边界的游戏。&lt;/p&gt;&lt;p&gt;社会是权力的展示。它是剧本性的，拥有既定的剧本，对剧本的偏离，马上会很明显地被看出来。偏离常轨是反社会的，因此被社会通过各种制裁所禁止。越轨之所以被禁止，原因很简单。如果社会成员不遵守社会固有规则，那么规则的数量将会变化，其中一些规则会被彻底抛弃，这将意味着过去的获胜者不再能保证获得对自己头衔的仪式性认可，从而失去权力——就像是俄国革命之后的俄国王公。&lt;/p&gt;&lt;p&gt;保证许多游戏的规则不被窜改，是社会的一项重要功能。像学术评审、贸易和职业的许可、宗教职务授任、国会对官员任命的通过和政治领袖的就职，这些流程都是社会对某些人在特定的有限游戏中进行竞争所做的批准。&lt;/p&gt;&lt;p&gt;然而，越轨却是文化的本质。谁要是仅仅跟随剧本亦步亦趋，重复过去，那么就是文化上的赤贫者。&lt;/p&gt;&lt;p&gt;越轨的性质各有不同，不是所有对过去的偏离都具有文化上的意义。切断与过去的联系，导致对过去的遗忘，这些做法在文化上毫无价值。给传统带来新的思维方式，使我们对一度熟悉的事物生出陌生感，对我们所拥有的一切进行再审视，这样做才是有意义的。&lt;/p&gt;&lt;p&gt;文化偏离不是将我们带回过往，而是将开始于过去并尚未结束的东西继续下去。而另一方面，社会习俗要求在未来完全地重复过往。&lt;strong&gt;社会对于不朽这件事情念念不忘&lt;/strong&gt;，而文化与不可知的各种可能性的欢笑琴瑟和鸣。社会是抽象的，文化是具体的。&lt;/p&gt;&lt;p&gt;有限的游戏能够反复玩无数次。诚然，游戏的获胜者总是在某一时间的特定游戏中获胜的，但是&lt;strong&gt;他们获得的头衔的有效性都有赖于此游戏的重复进行&lt;/strong&gt;。我们纪念早期的伟大橄榄球队运动员，但若橄榄球消失，不出十年，我们恐怕就记不起他们了。&lt;/p&gt;&lt;p&gt;正如我们所见的，因为无限的游戏不能有终点，所以它也无法重复。不可重复性是所有文化的典型特征。莫扎特的第四十一号交响曲不可能再创作一次，伦勃朗的自画像也不可能画两次。&lt;/p&gt;&lt;p&gt;社会将这些作品保存起来，认为它们是那些在各自游戏中获胜者的战果。然而，文化并不将这些作品视作奋斗的产物，而认为是奋斗过程中的瞬间——文化即奋斗本身。文化传承着莫扎特和伦勃朗对文化的传承，而二人对文化的传承，是通过自己的工作：对他们所接受的传统进行的原创性或改编性塑造。他们的工作是如此原创，以至于其他人无从复制，但是却呼唤着其他人原创式的回应。&lt;/p&gt;&lt;p&gt;正如无限的游戏有其规则，文化则有自己的传统。无限游戏中的规则能够自由达成或自由更改，文化传统也会被改造，并在改造中发生变化。&lt;/p&gt;&lt;p&gt;准确地说，文化并不是拥有一个传统，它本身就是传统。&lt;/p&gt;&lt;/div&gt;&lt;p&gt;正如开头所说，本书是用一种适合冥想的文字风格写作的，划分为一百零一个小节，又把它们按主题的共性放在七个章节下。这是其中的第 35 小节，出自第二章《没人能独自玩游戏》，我在引用时加粗了一些特别精彩的句子。&lt;/p&gt;&lt;p&gt;这是一个把两种概念有意对照、比较的一节，社会是“精心保持着边界”的，是恪守于剧本而抗拒变化的，而文化的本质却是原创、是越轨，是进行不可重复的新的塑造。我相信我的读者们都很熟悉这里写到的“社会”的秩序，对历史开辟者的尊崇，对不朽的迷恋，也是听起来很熟悉叙事。但不管这样的视角是否“正确”，在此对比之时，我们意识到这并不是唯一的认知方式。我们能欣赏、共情、参与创造的那些作品（伦勃朗、莫扎特的创作），其实都是在打破既定秩序的过程里才不断创造出来的。这种打破，这种原创，在这一章还有一个更具有感染力的词，叫“传奇性”。如果我们也想接续这种传奇，那么就不能止步于社会的规则和叙事（你可以说是“规训”），而意识到，还存在不同的“玩游戏的方式”。&lt;/p&gt;&lt;p&gt;如果只是单纯的二元对立，那这本书还不至于让我觉得精彩。&lt;/p&gt;&lt;p&gt;作者不光指出不同形式的有限游戏和无限游戏，谈它们有如何不同的性质和运转规则，还谈及两种游戏里都有的矛盾和悖论。比如紧接着的一章就讲，社会其实是文化的一种，而只是社会成员总是需要通过自我说服，忘掉这一点。同样的，社会成员作为有限游戏的参与者，必须自我遮蔽，才能忘记这个游戏是自愿参与的，游戏规则的所谓强制性，其实是由参与者自己所赋予的。&lt;/p&gt;&lt;p&gt;社会这个游戏，也有自己奇怪的逻辑和矛盾。作为社会重点保护的对象，财产，是一个需要花费大量精力维持的结构，却也是财产持有者的“双重包袱”（38-40章）。社会语境下的财产，是为了让人留意财产背后的人在竞争中的胜利，是一种头衔与标志。因此持有者需要证明财产和之前为了赢得竞争所付出的努力是相称的，财产的数额是合理的“补偿”。只是如此还不够，财产还需要被使用，付出所获得的东西需要被“消费”。而一个人手头的权力越大，财产越显著，社会就越是期待他们表现得懒惰、无所事事：富人需要坐豪华轿车出行，有闲阶级需要用各种消遣和无用品来填满时间。此时的“消费”和过去财富持有者在竞争中展示出的技能与力量对比鲜明，仿佛只有如此，胜者的身份才能被最充分的彰显。&lt;/p&gt;&lt;p&gt;当我按作者建议的方式去思考社会、头衔、财产的时候，我才发现我们惯常相信的认知，蛮可以在无限游戏的棱镜下，变得“有趣”，甚至“滑稽”。&lt;/p&gt;&lt;h3 id=&quot;-1&quot;&gt;二&lt;/h3&gt;&lt;p&gt;想到要推荐这本书，我其实有一些紧张。这并不是说这本书是“难读”的，我觉得这本书言语是很平实的，每个篇章不长而层层递进，所以想要跟随思路、找到阅读的“换气点”并不会过分困难。这本书的句子是简短的，又掷地有声，组成这么一本小小开本的书，反而是让我天然容易亲近的。&lt;/p&gt;&lt;p&gt;但我又觉得这本书和笛卡尔的《第一哲学沉思录》属于同一类，即使这次是从头认真读到尾，我也还会觉得自己读的仓促，会始终准备着下一次重读。我曾经翻过乔治·斯坦纳的访谈录《漫长的星期六》（这里有一篇网络上的&lt;a href=&quot;https://blog.wenxuecity.com/myblog/78477/202404/11272.html&quot;&gt;读书笔记&lt;/a&gt;），里面他说自己会把旧约和笛卡尔的这本《沉思录》在手边反反复复的看，不断地获得启示 —— 我也受此影响，渐渐体会重读经典的意趣。&lt;/p&gt;&lt;p&gt;像今年读的《锻炼》或《人类简史》这样的书，我可以满含求知欣喜地把一些逻辑清晰、有实证证据的观点分享出来，也更容易让我的读者感受“新知”的魅力。但这种思辨意涵丰富的书，让我诚惶诚恐，虽然自己被邀请进入作者的世界，也在遨游途中采拮到奇芳野草；但不敢把眼前所见仓促概括，恐怕自己的理解不够深，担心误导未读过原著的读者，也不愿贻笑大方。&lt;/p&gt;&lt;p&gt;那么，我能做的就只是沉默吗？我想也不是。当我记述自己的理解、真实的惊喜和共鸣时，这怎么不是一种“原创性”的回应呢？这本书教会我的，正是可以始终去玩无限者的游戏，去认识到“我是自己的天才”，而用“天才回应天才”。意识到这点，我才放松心态，认定自己真诚的书写自有其价值。&lt;/p&gt;&lt;h3 id=&quot;-2&quot;&gt;三&lt;/h3&gt;&lt;p&gt;书本的最后一章只有一句话。如果放慢节奏，跟着前面的文本一起沉思，读到这里时可能会收获一种“闻道”者的欣喜。&lt;/p&gt;&lt;p&gt;在那个瞬间，我想的是：“多酷呀”。&lt;/p&gt;"},{"id":"https://star-du.github.io/eleventy-blog/2023-duku/","url":"https://star-du.github.io/eleventy-blog/2023-duku/","title":"过去一年的读库","date_published":"2024-02-09T00:00:00Z","language":"","content_html":"&lt;p&gt;过去一年的读库，自己读得比较喜欢的是 2306 和 2301 两卷，2302 和 2305 次之，剩下两本和我的兴趣重合最少。&lt;/p&gt;&lt;h3 id=&quot;1&quot;&gt;1&lt;/h3&gt;&lt;p&gt;自己既往曾自我检视过，story-telling 对自己是有很大吸引力的，在只载录非虚构的读库，精彩的故事与跌宕的叙述，也让我随之心潮澎湃。&lt;/p&gt;&lt;p&gt;比如 2306 的《边境风云》，涉及云南-缅甸边疆和边境线内外的政治、宗教力量彼此消长，最后聚拢到一个共产党视角的奇才、功臣。这个故事牵涉边陲的传教士、土司、以铜金为源流的佛教势力和政府、革命派，各方关系的交错复杂和人物的多面，都得其所分的写出来了，没有落入（某些）党史叙事的狭隘。&lt;/p&gt;&lt;p&gt;从主观视角来叙事，也是自己很爱读的类别，作者愿意给你呈现自己的内在视角，让读者也很愿意同他/她呼吸相连、情感相通。2306 的《相亲》写为儿子相亲的老妈。2305 有《考证》，书写建筑行业考取资格证的私人史。后面一篇《我和父亲在工地》，写起来非常是“底层”视角，但又是置身于内的书写，不含怜悯与想象。2302《无声之辩》与2301《阿觉娃的故事》都是自述，语言不带雕琢，也容易传递出和人对话的亲近感；一个是为聋哑人做辩护的律师，一个是做过不同工作、经历大事小事的藏族女性，于我而言开拓到了新的疆域、更理解不熟悉的群体。这方面 2301 的《龙仁三十天》，作者记叙自己在西藏短暂的教书经历，也值得一提。&lt;/p&gt;&lt;h3 id=&quot;2&quot;&gt;2&lt;/h3&gt;&lt;p&gt;另一个切入点是知识。具体、生动地呈现人类在某个领域的探索和成果，是让我享受的。我还记得 2301 《天选之子》里面尝试给 Fermi paradox 提供解释，作者论证为什么即使宇宙天体那么浩渺，人类这种形式和智慧程度在此时此刻的存在也可能是极其罕有的。后面&lt;a href=&quot;https://star-du.github.io/eleventy-blog/extraterrestrial-life/&quot;&gt;又读了《地外生命》&lt;/a&gt;，有主题相关的讨论，对地球生命得以存在的巧合性也有强调。同一卷的《番薯盛世》介绍美洲粮食作物给明清的人口与生活形态带来的变革，相当出乎我的意料。以我的阅读视野，这种以一个具体的“物”或“事件”侧写历史的做法，也是成果颇丰的写作方式。&lt;/p&gt;&lt;p&gt;有些“知识”，只是一个不太主流的领域，或是一小段时期的社会记忆、文化生活史，呈现出琐碎和无关紧要的面目，但却同时也让我觉得读起来很放松、很沉浸，毫不阻碍我生发出相当程度的兴趣。2306 的《黑胶唱片何以复兴？》是这样，2301 的《互联网前的互联网》和 2302《两届而终》也是。这里还要提到出自 2302 的《兽行记》，作者萨苏写动物的事体很有一手。&lt;/p&gt;&lt;h3 id=&quot;3&quot;&gt;3&lt;/h3&gt;&lt;p&gt;其他一些我喜爱的文章，可以凑到有深度的思考，或严肃、真诚的人文关怀这个特质下面。《知识分子去哪了？》和《“穷途末路”的英语专业》在 2306 连发两文，对如今大学的运行模式和与大学教育体制打交道的杰出头脑，颇多发问，有点“知我者谓我心忧”的意思。2303 的《一个历史学家，不再对帝王热情》采访罗新，在我&lt;a href=&quot;https://star-du.github.io/eleventy-blog/travel-on-paper/&quot;&gt;读过他的《从大都到上都》&lt;/a&gt;之后，这里的作者现身，让我读得欢喜。2302 还有一篇《改革初年》，作者自叙的是改革开放之初的社会思想风气，反思与求新，这些气质以个人的观察视角写出，是真正在加深我们对共和国史的认识。&lt;/p&gt;&lt;p&gt;值得一提，2304 和 2305 有两三篇介绍人工智能发展的历史，和如今的现状，本身的质量还是不错。但或许因为是自己熟悉的“行当”，相关的话题自己有一些知识储备，自己在博客、专栏甚至 newsletter 里也见到很多描述与思考，所以倒没有哪篇特别留下深刻印象的了。&lt;/p&gt;"},{"id":"https://star-du.github.io/eleventy-blog/dali-book/","url":"https://star-du.github.io/eleventy-blog/dali-book/","title":"万哲生的大理速写本","date_published":"2024-01-26T00:00:00Z","language":"","content_html":"&lt;p&gt;最近在云南旅行期间，翻读完了万哲生（Jason Pym）的《大理外传》。&lt;/p&gt;&lt;p&gt;本书的副标题叫“一个英国人的大理速写本”，英国人指出作者在大理定居十多年的异国身份，而什么叫速写本呢？是因为本书并不单以文字承载主要信息，而更像我小时候爱读的百科全书，文本和作者手绘的插图交相辉映；另一方面，虽然划分了古城、苍山、洱海、喜州、下关和大理历史六个章节，每个章节内部也只是松散联系：每一页或者几页的图文围绕一个相对聚焦的话题，而话题之间并不一定有明显的承续关系。&lt;/p&gt;&lt;p&gt;这样自由散漫的结构下，每页的内容和插画又轻松有趣，绝不泛泛而谈，而敏锐探寻和记录着每一个细节，让我足以被书背后的“英国人”的好奇心感染。随手可以举出作者在《苍山》一章的例子，一开头作者就画出了苍山的十九峰十八溪示意图，给每个地标都配了一个形象可爱的徽标（“Logo”），然后开始细细展开苍山上丰富的植物动物，讲起花，就写苍山杜鹃花的品种，写到雨季的菌子，就画出野生菌的图录。这里有着百科全书似的精细，线描的图鉴画面让不辨菽麦的我也能一下子知其精要；同时也不乏作者的俏皮和创造性的演绎，在小孢毛鬼伞（一种伞菌）的插图里就会画一只躲在伞盖下的小鬼。这样的例子在书中俯拾皆是，让小孩和大人读恐怕都会兴致盎然。&lt;/p&gt;&lt;p class=&quot;chinese_italic&quot;&gt;下面贴上书中第 62 页和 63 页，作为开胃菜&lt;/p&gt;&lt;img src=&quot;https://star-du.github.io/images/dali_book_62.jpg&quot; class=&quot;book_image&quot; style=&quot;margin-bottom: 2rem&quot; /&gt;&lt;img src=&quot;https://star-du.github.io/images/dali_book_63.jpg&quot; class=&quot;book_image&quot; /&gt;&lt;p&gt;话说回来，自己翻开这本书时获得的享受，和自己去大理、喜欢大理的心情，肯定也交织在一起。即使不用作者在前言后记里面说什么，从笔下细致的观察，有创造力的绘图，都能清楚无误的感觉他对大理的温情与喜爱。大理的气候、物产和风光都太受大自然眷顾了，此处的文化又绝不是蛮荒之地（关于白族、回族、彝族的文化交融，当可另开一文），于是一代又一代的吸引着各样的人们在此驻足，人的交流碰撞又在此激发出新的魅力。这大概是大理吸引作者，也吸引我的缘由一二了。&lt;/p&gt;&lt;p&gt;那对一个没去过大理的人，这本书又如何呢？我觉得当一本有趣的自然、文化笔记，读来也很轻松畅快（总比引发无穷焦虑的小红书看起来开心）。&lt;br /&gt;当然，我的建议么，有机会总还是该去大理看看的…&lt;/p&gt;"},{"id":"https://star-du.github.io/eleventy-blog/bookkeeping-with-excel/","url":"https://star-du.github.io/eleventy-blog/bookkeeping-with-excel/","title":"我的 Excel 个人记账实践","date_published":"2024-01-06T00:00:00Z","language":"","content_html":"&lt;p&gt;一般来说，在讲清楚 How 之前，对 What 和 Why 的介绍是很有意义的。不过这里，让我假定你已经知道记账是什么，也怀揣着想要记账的意图了。我会分享我的记账思路，提供一个我创建的 Excel 模版，也讲讲我踩过的坑，希望能让你的记账之旅更顺利。&lt;br /&gt;不过在此之前，铺垫一些基本原理是必要的…&lt;/p&gt;&lt;h3 id=&quot;&quot;&gt;两张财务报表&lt;/h3&gt;&lt;p&gt;记账离不开会计学（accounting）。这个学科的基础，在于三类基本的财务报表，正如凳子的三只腿：&lt;/p&gt;&lt;ul&gt;&lt;li&gt;资产负债表 balance sheet&lt;/li&gt;&lt;li&gt;现金流量表 cash flow&lt;/li&gt;&lt;li&gt;利润表 income statement, P &amp;amp; L statement&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;资产负债表的基础是如下定义（会计恒等式，&lt;em&gt;The Accounting Equation&lt;/em&gt;）：&lt;/p&gt;&lt;blockquote&gt;&lt;p&gt;资产 = 负债 + 所有者权益&lt;/p&gt;&lt;/blockquote&gt;&lt;p&gt;这张表是一个快照（snapshot），它反映某个时间点的状况。&lt;/p&gt;&lt;p&gt;而利润表反映的是某个时间段的状况，就像连接两个时间点的线段。&lt;/p&gt;&lt;blockquote&gt;&lt;p&gt;毛利 = 收入 - 成本&lt;/p&gt;&lt;p&gt;净利润 = 毛利 - 费用&lt;/p&gt;&lt;/blockquote&gt;&lt;p&gt;这里算出来本期的净利润，就是联系资产负债表和利润表的公共项。&lt;sup class=&quot;footnote-ref&quot;&gt;&lt;a href=&quot;https://star-du.github.io/eleventy-blog/bookkeeping-with-excel/#fn1&quot; id=&quot;fnref1&quot;&gt;[1]&lt;/a&gt;&lt;/sup&gt;&lt;/p&gt;&lt;p&gt;另一个你可能听过的词语是“复式记账”（&lt;a href=&quot;https://en.wikipedia.org/wiki/Double-entry_bookkeeping&quot;&gt;double-entry bookkeeping&lt;/a&gt;）。这个术语是指把每笔账（交易， transaction）都会记在两个不同的账户里。&lt;br /&gt;这个词听起来不太直观。我的判别标准是，只要你记下的帐能通过某种方法去核验，而不只是无法查证的单一记录，你就是在践行复式记账的精神。你也可以用自己的 judgement 判断，我下面的记账方法是否够得上这一标准。&lt;/p&gt;&lt;h3 id=&quot;excel&quot;&gt;在 Excel 里付诸实践&lt;/h3&gt;&lt;p&gt;为了便于说明，我创建了一个 Excel 模版 &lt;sup class=&quot;footnote-ref&quot;&gt;&lt;a href=&quot;https://star-du.github.io/eleventy-blog/bookkeeping-with-excel/#fn2&quot; id=&quot;fnref2&quot;&gt;[2]&lt;/a&gt;&lt;/sup&gt;，其中每一个记账周期大概长这个样子：&lt;/p&gt;&lt;img src=&quot;https://star-du.github.io/images/bookkeeping_excel_template.png&quot; /&gt;&lt;h3 id=&quot;-1&quot;&gt;我的使用之道&lt;/h3&gt;&lt;h4 id=&quot;-2&quot;&gt;整体观之&lt;/h4&gt;&lt;p&gt;前面三列（A, B, C）其实是资产负债表，拿总资产减去负债，计算出记账时的所有者权益，在我的语境下和净资产也相等。右侧(G, I) Income Statement 的几个板块相加减（收入 + 投资变动 - 支出），与净资产变动相等，由此可以快速计算出每一期的支出（图中的 &lt;code&gt;I39&lt;/code&gt;）。而第 H 列是计算过程中的中间数据，提供其他有用信息。&lt;/p&gt;&lt;p&gt;如此布局，是因为对我而言，目前有多少净资产（资产负债表的所有者权益），以及每月支出如何（利润表中的费用）最受关注。同时，我也希望扫一眼就能回答一些自己好奇的问题：在所有资产里，有多少钱是灵活可用的？自己的投资波动占每月资产变动的多少？&lt;/p&gt;&lt;h4 id=&quot;-3&quot;&gt;应收、待摊和应付&lt;/h4&gt;&lt;p&gt;在资产负债表里，前两项属于资产，而最后一项属于负债。所以当应收款项收到时，只是把钱从资产的一个篮子里，移到另一个篮子（银行卡余额），不会有别的变动反映。待摊费用是所有已经支付，但还未使用的花费，例如我付了某个酒店的定金，如果它的政策上可以免费取消，则我可以在入住前随时取消，把这笔钱放回现金账户；如果酒店需要支付取消费用，则这笔费用正常计入开支即可，也很直观易懂。&lt;/p&gt;&lt;p&gt;“应付”从会计学的角度，其实分为账款和票据，一个区别是前者一般需要短期还款、没有利息，而后者还款期限长、但有利息。在我的实际情况里，我会习惯把负债尽快还清，所以会简化成一栏进行记录。如果有长期贷款（比如分期的商品和车贷、房贷），也可以更详细的分开统计。&lt;/p&gt;&lt;h4 id=&quot;-4&quot;&gt;投资变动&lt;/h4&gt;&lt;p&gt;在利润表里，我把投资变动从收入中单独列出了。在我的标准里，收入是全职工作的工资、股票年金、公积金之类，是纯粹的正值。而投资变动则是有正有负的，也在我的另一个心理账户（ &lt;a href=&quot;https://en.wikipedia.org/wiki/Mental_accounting&quot;&gt;mental accounting&lt;/a&gt;）之内。&lt;br /&gt;其中有些特别的是定投，因为每一期都会有投入，所以实际的定投收益是定投账户的变动（&lt;code&gt;C26&lt;/code&gt;）再减去本期投入的金额（&lt;code&gt;H27&lt;/code&gt;）。图上这期定投就是负收益，亏损了 295 元。&lt;/p&gt;&lt;h4 id=&quot;-5&quot;&gt;复式记账&lt;/h4&gt;&lt;p&gt;如果严格践行复式记账，每一笔支出都可以同时列在对应类目的账户上，这样将这些账户的变动相加，应该等于左侧算出的净资产变动 —— 计算这个相等关系，就可以收到核算之效。不过我在实践中采取更方便的简化，每次会在支出下面单列出较大的几笔交易，把剩下的交易都归并到“维持/改善”中。这样，我只用核查这些“常规”开支是否在我心中的预期区间，而不用一一计算了。&lt;br /&gt;每次打开 Excel 上之前，自己心里会带着对过去一段时间收入支出的印象，对这期有个模糊的预测。而当初次核算完成，得到当期的实际开支，自然会拿去和脑袋里预测的开支比较。如果发现了差距，大脑就会不自觉的启动 debug 模式：到底哪里出问题了呢？&lt;/p&gt;&lt;p&gt;Debugging （核算）&lt;/p&gt;&lt;ol&gt;&lt;li&gt;资产：我的习惯是把手头的活钱放在一张卡上（如招商银行的朝朝宝），其余用于理财、投资的钱如果变化了，一般也会留有印象。所以资产项我主要会看微信和支付宝的余额，有时收到朋友的转账，还没来得及存到卡上，会在这时检查到。&lt;/li&gt;&lt;li&gt;应收、待摊和应付：这里是遗漏的重灾区，临时刷的信用卡、帮朋友垫付的开销，还有等待报销的金额…&lt;/li&gt;&lt;li&gt;收入：除了查漏，这里也要看看有没有 double-counting。开始记账时一个常见误区是：上一次应收款这次收到后，把这笔钱记成了收入；实际上，钱从应收账款移到现金账户，本身就已反映了变动，无需在收入这一栏统计了。&lt;/li&gt;&lt;li&gt;投资变动：我买的定投收益变动很大，所以有时影响净资产的不是开支，而是定投亏的钱（哭）。自从发现遇到节假日休市，定投会暂停，我每次都会 double-check 投资的买入记录。&lt;/li&gt;&lt;li&gt;开支的账单：最可靠的方法还是更严格的复式记账了，核对银行卡的账单，按金额倒着排个序，就能有些意想不到的发现。&lt;/li&gt;&lt;li&gt;如果到此，还没有发现问题，那大概率资产负债表是准确的，而自己可能高估或者低估了过去的花销。Well，恭喜自己，这次记账很有收获。&lt;/li&gt;&lt;/ol&gt;&lt;h4 id=&quot;-6&quot;&gt;基于报表的分析&lt;/h4&gt;&lt;p&gt;每期记账，我会在最右边列一些分析和想法（为了保持清晰，截图中并未体现，可打开模版中的第 K 列）。有时发现某个开销最近水涨船高，值得注意；另一些时候比较某次在外吃饭的开销和当时的感受，对自己脑中的餐厅排序也能做一个最新更新。再比如，我一时兴起，拿最近半年有代表性的开支项做了个统计，算了下在本地吃简餐 / 喝饮料 / 吃正餐分别要花多少钱，再和之前出门玩的车票、酒店这些开支做对比，很迅速地发现自己对钱更有概念了。&lt;/p&gt;&lt;p&gt;我每一期记账的表头，都与上一期有着固定的间距，这样为后续的“宏观”分析提供很多方便。我最近就写了个 Excel 公式，用 &lt;code&gt;OFFSET&lt;/code&gt; 函数找到每一期的资产和支出，列出它们随时间的变化，还顺手用自带的工具把这些数据点描线成图。如果数据量有一定的积累，可以算算平均数、中位数，还可以用 &lt;a href=&quot;https://support.microsoft.com/zh-cn/office/%E4%BD%BF%E7%94%A8%E6%9D%A1%E4%BB%B6%E6%A0%BC%E5%BC%8F%E7%AA%81%E5%87%BA%E6%98%BE%E7%A4%BA%E4%BF%A1%E6%81%AF-fed60dfa-1d3f-4e13-9ecb-f1951ff89d7f&quot;&gt;条件格式&lt;/a&gt;，把特别显眼的数据（outlier）标出来，回过头去看看原始记录。这个过程让我挺有成就感的。&lt;br /&gt;我也在模版的第二张分表（点击左下角的 sheet 2）里展示了如何用样表的三期数据做些简单分析。&lt;/p&gt;&lt;h3 id=&quot;-7&quot;&gt;小结&lt;/h3&gt;&lt;p&gt;用 Excel 记账的过程，实际是在做两件事：算出自己手头“钱”的变化（1），同时列出变化背后赚的钱从哪来，花的钱到哪去（2）。如果这两种方式算的结果“对的上”，那自己就有信心记账的过程没有遗漏、也不出错误。而 Excel 表格是一种标准化的形式，让这个流程清晰、明确。&lt;/p&gt;&lt;p&gt;花不太多的时间记下这些帐，自己能掌握一段时间的支出，同时也能对自己的资产现状心中有数。前者常常让我发现一些不曾留意的账目需要理清：有笔报销还没提，有次聚餐还没记得发起 AA；而后者则是一切财务计划和投资的基础，可以直接指导，比方说，自己一次性手头能拿出多少钱，或者花百分之二十做定投的抽象理念对应成每周要投多少钱。&lt;/p&gt;&lt;p&gt;或者我可以说，记账的过程，是让自己专心审视怎样和金钱打交道的过程。当我确切知道自己过去花了多少钱、挣了多少钱时，自己更能“认清自己”了，安心的感觉也相伴而生。&lt;/p&gt;&lt;p&gt;也欢迎你参考我的 Excel 模版&lt;sup class=&quot;footnote-ref&quot;&gt;&lt;a href=&quot;https://star-du.github.io/eleventy-blog/bookkeeping-with-excel/#fn2&quot; id=&quot;fnref2:1&quot;&gt;[2:1]&lt;/a&gt;&lt;/sup&gt;，试试这样记账！&lt;/p&gt;&lt;hr class=&quot;footnotes-sep&quot; /&gt;&lt;section class=&quot;footnotes&quot;&gt;&lt;ol class=&quot;footnotes-list&quot;&gt;&lt;li id=&quot;fn1&quot; class=&quot;footnote-item&quot;&gt;&lt;p&gt;如果足够好奇，推荐阅读达雷尔·穆利斯 Darrell Mullis 和朱迪丝·奥洛夫 Judith Orloff 所写的《世界上最简单的会计书》，生动有趣的带我领略了这些会计学的风光。 &lt;a href=&quot;https://star-du.github.io/eleventy-blog/bookkeeping-with-excel/#fnref1&quot; class=&quot;footnote-backref&quot;&gt;↩︎&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;li id=&quot;fn2&quot; class=&quot;footnote-item&quot;&gt;&lt;p&gt;Excel 模版可以从 &lt;a href=&quot;https://1drv.ms/x/s!Ao8DtKvEmzJRpk3S-R4kt6ET_nXL&quot;&gt;OneDrive&lt;/a&gt; 下载 😊 &lt;a href=&quot;https://star-du.github.io/eleventy-blog/bookkeeping-with-excel/#fnref2&quot; class=&quot;footnote-backref&quot;&gt;↩︎&lt;/a&gt; &lt;a href=&quot;https://star-du.github.io/eleventy-blog/bookkeeping-with-excel/#fnref2:1&quot; class=&quot;footnote-backref&quot;&gt;↩︎&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;/ol&gt;&lt;/section&gt;"},{"id":"https://star-du.github.io/eleventy-blog/why-writing-blog/","url":"https://star-du.github.io/eleventy-blog/why-writing-blog/","title":"写博客之意义三则","date_published":"2023-12-03T00:00:00Z","language":"","content_html":"&lt;p&gt;三篇札记。&lt;/p&gt;&lt;h2 id=&quot;&quot;&gt;一&lt;/h2&gt;&lt;p&gt;椒盐豆豉女士的 &lt;a href=&quot;https://blog.douchi.space/2023-why-you-need-a-blog/#gsc.tab=0&quot;&gt;2023 年了你为什么需要写博客&lt;/a&gt; 很具说服力，博客既承载着创造与分享的诸多益处，又因其媒介的形式在 2023 年仍具有独特价值。特别是后者：各大社交平台创建了各自的封闭空间，它们接管了博客搭建、维护和互相连接的劳碌，也在不那么明显的地方设置限制，索求回报。对外链的管制、广告，平台内可以创作的内容与形式的限制，这些都是素有经验的使用者所习惯的了。而博客是开放的，是受自己控制而不必听命于他人的。&lt;/p&gt;&lt;h2 id=&quot;-1&quot;&gt;二&lt;/h2&gt;&lt;p&gt;刘未鹏 | Mind Hacks 09 年的这篇 &lt;a href=&quot;http://mindhacks.cn/2009/02/15/why-you-should-start-blogging-now/&quot;&gt;为什么你应该（从现在开始就）写博客&lt;/a&gt; 来源于上一篇的引介。因为主题看起来重合本不欲细读，但其实内容相当雄辩，激励之效非凡。作者甚至对博文内容提供了一句话的概括，即&lt;/p&gt;&lt;blockquote&gt;&lt;p&gt;写一个博客有很多好处，却没有任何明显的坏处。&lt;/p&gt;&lt;/blockquote&gt;&lt;h2 id=&quot;-2&quot;&gt;三&lt;/h2&gt;&lt;p&gt;我的补充&lt;/p&gt;&lt;ol&gt;&lt;li&gt;写博客之后你会更自然的愿意读博客（哪怕是为了从别人那里偷师最新最酷的组件和皮肤）。而愿意码字、更新、定期维护的博文，确实很多都沉淀思考，有的还相当用心。这个过程，是一场有意思的定期拜访，也让我常常愉快的与意外收获迎面相遇。&lt;/li&gt;&lt;li&gt;博客往往也是超链接的使用重镇。从你喜欢的一篇博文出发，可以引向一个丰富的世界。如果你想我一样享受这种跳进兔子洞的体验，那么写作博客也或许为他人做如此贡献。&lt;/li&gt;&lt;li&gt;昨天 come across 了一个从 2003 年开始，持续笔耕不辍 &lt;strong&gt;20 年&lt;/strong&gt;的技术博客 &lt;a href=&quot;https://devblogs.microsoft.com/oldnewthing/&quot;&gt;The Old New Thing&lt;/a&gt; （甚至是 affiliate 到微软技术博客下面的）。这个博客不仅最近还在规律更新，而且还时常能收获 reaction 和留言讨论（比如 &lt;a href=&quot;https://devblogs.microsoft.com/oldnewthing/20230911-00/?p=108749&quot;&gt;这篇&lt;/a&gt; 被 O’Reilly 的 &lt;a href=&quot;https://www.oreilly.com/radar/topics/radar-trends/&quot;&gt;Radar Trends&lt;/a&gt; 栏目推荐）。想想有人在做这样的事，让自己的博客成为职业和个人生涯的痕迹与记录，这件事本身就挺浪漫的。&lt;/li&gt;&lt;/ol&gt;"},{"id":"https://star-du.github.io/eleventy-blog/unicode-in-2023/","url":"https://star-du.github.io/eleventy-blog/unicode-in-2023/","title":"在 2023 重新学习 Unicode (UTF-8)","date_published":"2023-11-19T00:00:00Z","language":"","content_html":"&lt;p&gt;&lt;b&gt;Disclaimer:&lt;/b&gt; &lt;a href=&quot;https://zh.wikipedia.org/zh-hans/Wikipedia:%E5%B0%8F%E4%BD%9C%E5%93%81&quot;&gt;本文是一篇小作品，取自维基百科的体裁定义 →&lt;/a&gt;&lt;/p&gt;&lt;p&gt;中英对照版原文: &lt;a href=&quot;https://blog.xinshijiededa.men/unicode/#user-content-fn-touche&quot;&gt;The Absolute Minimum Every Software Developer Must Know About Unicode in 2023 (Still No Excuses!)&lt;/a&gt; by Nikita&lt;/p&gt;&lt;p&gt;UTF-8 是可变长编码，指的是其中的每个字符（character）所占字节数为 1 至 4。字符被指定了对应的数字序号，也就是码位（code point），所以码位和字符是一一对应的。所谓编码（encoding），就是码位在内存中的存储方式。UTF-16 最初被设计为一种定长的编码，也就是每个码位始终由 16 个字节表示，但随后我们发现这样做是不可行的。&lt;/p&gt;&lt;p&gt;码位的概念只和存储直接相关，而对于人的交互和使用来说，扩展字位簇（extended grapheme cluster）才是我们直观认为的最小单元。每个 grapheme 可以使用多个码位进行编码：&lt;/p&gt;&lt;blockquote&gt;&lt;p&gt;比如说，&lt;code&gt;é&lt;/code&gt;（一个单独的字位）在 Unicode 中被编码为 &lt;code&gt;e&lt;/code&gt;（U+0065 拉丁小写字母 E）+ &lt;code&gt;´&lt;/code&gt;（U+0301 连接重音符）。两个码位！&lt;/p&gt;&lt;/blockquote&gt;&lt;p&gt;grapheme 应当在使用中被视为不可分割的单元，应该作为整体被选择、复制、删除 —— 这意味着我们认为很直观的 &lt;code&gt;len&lt;/code&gt;，&lt;code&gt;substring&lt;/code&gt; 等方法，正确的处理都并不能靠 code point 作为区分标准，而需要查阅 Unicode 的表。而且，Unicode 标准每年还在更新，这意味着我们需要一个外部库来处理 Unicode，比如 Rust 的 &lt;a href=&quot;https://crates.io/crates/unicode-segmentation&quot;&gt;unicode-segmentation&lt;/a&gt;  。（很难指望编程语言跟上这个步伐，不过，据作者说 Swift 好像是现代语言中做的较好的）。&lt;/p&gt;&lt;p&gt;Unicode 还有其他的 intricacies 和 imperfections，其中之一就是有些字形被分配了相同的码位，而依赖区域设置 (locale) 。甚至有些意想不到的操作（&lt;code&gt;String::toLowerCase&lt;/code&gt;）也与区域相关。而另一些字形互为变体，在进行搜索、比对等操作时，似乎应该归一化。&lt;/p&gt;"},{"id":"https://star-du.github.io/eleventy-blog/extraterrestrial-life/","url":"https://star-du.github.io/eleventy-blog/extraterrestrial-life/","title":"《地外生命》——我们是孤独的吗？","date_published":"2023-11-12T00:00:00Z","language":"","content_html":"&lt;p&gt;因为是读库送来的书，拆开的时候看到这个标题有一些开刮刮乐的气氛。“阿，地外生命”，我微微一笑，觉得确实是摆在书店里我也不太会翻开的选题，脑袋里也已经在盘算着适合放在哪里看这本书了。&lt;/p&gt;&lt;p&gt;放在手里一掂，只是本一百六十页的小书，纸张柔软微黄，开本小巧，让我翻开一点都没有压力。于是我就把它顺手装进包里，准备带到 Office，在等待代码编译的时候随手翻翻。不过自己也没有太按照计划实施。书放到座位边挺久了，中午或者休息时也会拿起来翻一翻，但每次翻个两页，下次看再往前回顾一页，读起来也不太容易进入状态。于是一两个月过去了，也还在第一章结尾部分打转。&lt;/p&gt;&lt;p&gt;后来转机来自公司团建，在路途的大巴上，也就是一个人坐着，放在手里的这本小书成了我愿意投入精力的对象。此时读第二章和第三章，思索地球上生命的形成和影响这一过程的微妙因素，忽然觉得津津有味。虽然在中学时学习过生物如何走出海洋，迈向陆地，并分化演化，但相较而言，这两章的描述就要更完整和有趣。举一个例子，原核生物是如何演变成真核生物，单细胞又如何进化到多细胞生物的？这本书给了一个解释，认为这个过程和氧气很有关系。条分缕析来说，大概是：&lt;/p&gt;&lt;ol&gt;&lt;li&gt;由于蓝藻细菌的作用，氧气不断产生并改变大气环境。在 24 亿至 20 亿年前，氧气浓度蓄积超过一定临界值，出现了“大氧化事件”（Great Oxygenation Event）&lt;/li&gt;&lt;li&gt;厌氧生物不适应环境而死亡，但也出现一些占优势的好氧微生物。这些好氧微生物因为使用有氧呼吸，能产生十倍于无氧呼吸的能量，在竞争上处于优势。&lt;/li&gt;&lt;li&gt;据说是我们的细胞祖先吞噬，或者这些好氧微生物主动进入细胞体，因此成了真核细胞内的线粒体，负责细胞的呼吸作用。（按“内共生学说”的假设，真核生物的细胞核，也是吞噬进来的其他古菌）类似的，一些蓝藻细菌入侵细胞，变成叶绿体，让动物细胞有了光合作用的能力，发生“植物化”。&lt;/li&gt;&lt;li&gt;有氧呼吸虽然能量生成很高效，但会产生高活性的自由基，对生物体有害。而一种进化策略是，让多个细胞聚集在一起，在中间形成厌氧环境，用于保存遗传物质，外侧细胞则能活跃的进行有氧呼吸，这样遗传物质被保存下来，细胞也能高效的进行生命活动。&lt;sup class=&quot;footnote-ref&quot;&gt;&lt;a href=&quot;https://star-du.github.io/eleventy-blog/extraterrestrial-life/#fn1&quot; id=&quot;fnref1&quot;&gt;[1]&lt;/a&gt;&lt;/sup&gt;&lt;/li&gt;&lt;li&gt;在上一条中，中间被低氧环境保护起来的细胞，就是卵子细胞（的祖先）；外侧细胞死亡更迭，但卵子细胞能被严密保护起来，这也和现存多细胞动物的卵子相对位置一致。&lt;/li&gt;&lt;/ol&gt;&lt;p&gt;后面，作者还介绍了性（减数分裂）的起源和大脑的起源，以及语言和智慧的起源，都让我感觉好奇心被滋养和满足。&lt;/p&gt;&lt;p&gt;话说回来，明明是地外生命，为什么这里讲着讲着在关注地球生命的进化历程呢？两位合著者在开篇对这个也有解说。因为地球生命是我们唯一确凿了解的，所以先去理解它们的形成历程，能让我们略微猜想生命形成过程中哪些因素有必然的影响，哪些则是巧合、甚至奇迹。而与一般的生物学不同的是，这里还会更带着一种天文的/宇宙学的视角，在天地形成过程间用目前的知识，设想行星表面温度、水含量，和卫星（月球）的大小、公转方式，以及恒星（太阳）的类型，如果这些条件稍有不同，可能会怎样？&lt;/p&gt;&lt;p&gt;有了这些知识，第四章和第五章可能更天文物理些，探究太阳系里如果存在生命，它们可能生活在何处（主要探讨火星，以及木星和土星的卫星），然后把目标放在太阳系外，思考我们可能如何观测系外存在的生命，或者我们（人类和系外的智慧生命）是否有可能互相接触。&lt;/p&gt;&lt;p&gt;这些事情都比较“超脱”于日常的话题，但也正因此给我带来阅读的轻快和喜悦。顺便一提，这个领域看起来是由生物学和天文学共同参与的，书的作者也分别是生物学者和天文学家；看他们一个更相信生物诞生是地球的奇迹（地外生命“怀疑派”），另一个则见识到系外行星的浩渺，以及宜居环境的多种多样，而更“确信”地外生命可能存在，本身也让这本书读起来更有意思。&lt;/p&gt;&lt;p&gt;至于我嘛，我到底是更确信、还是更怀疑？我觉得这个问题确实有哲学的一面，知道有地外生命，人类可能并不“孤单”了，但也许又没那么“独特”，我们的诞生也许不是奇迹般的偶然，而是宇宙规律下的必然形成，这好像让人没那么多资格骄傲了。但如果有别的生命，我们的观念和哲学会有什么样的碰撞呢？我们也许成了双盲实验的两个被试对象，忽然建立了联络，于是对宇宙这个实验，和背后的实验者，忽然增进了很多理解，想一想就让人有些激动…&lt;/p&gt;&lt;hr class=&quot;footnotes-sep&quot; /&gt;&lt;section class=&quot;footnotes&quot;&gt;&lt;ol class=&quot;footnotes-list&quot;&gt;&lt;li id=&quot;fn1&quot; class=&quot;footnote-item&quot;&gt;&lt;p&gt;第四条和第五条可能尤其是假说，但以我的生物知识看，好像是合情理的。 &lt;a href=&quot;https://star-du.github.io/eleventy-blog/extraterrestrial-life/#fnref1&quot; class=&quot;footnote-backref&quot;&gt;↩︎&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;/ol&gt;&lt;/section&gt;"},{"id":"https://star-du.github.io/eleventy-blog/digital-garden/","url":"https://star-du.github.io/eleventy-blog/digital-garden/","title":"数字花园","date_published":"2023-11-07T00:00:00Z","language":"","content_html":"&lt;p&gt;Reading about “digital garden” in &lt;a href=&quot;https://joelhooks.com/digital-garden/&quot;&gt;Joel Hooks’s blog&lt;/a&gt;.&lt;/p&gt;&lt;p&gt;之前大约是初次接触 Roam Research/Obsidian/Logseq 这类双链笔记时听过这个概念，但没有去深究。这次读到一个（看起来）比较个人化的叙述，感觉其特别点在于：&lt;/p&gt;&lt;ul&gt;&lt;li&gt;强调“生长性”，而非用于展示的成品&lt;/li&gt;&lt;li&gt;非表演性。应该是一片个人的园地，而非个人品牌营销的一环。（更多演绎在此篇&lt;a href=&quot;https://joelhooks.com/on-writing-more&quot;&gt;文章&lt;/a&gt;）。不要让过多的期待和规矩束缚自己，从而阻碍写作的热情。&lt;ul&gt;&lt;li&gt;也可理解为 &lt;em&gt;against perfectionism&lt;/em&gt;&lt;/li&gt;&lt;/ul&gt;&lt;/li&gt;&lt;li&gt;允许有些观念消亡，有些计划放弃，而另一些茁壮成长，并可能与其他环节发生互动&lt;/li&gt;&lt;li&gt;接受混乱，不以时间顺序为唯一重要的排序，而可采用精选、感兴趣的链接等方式呈现&lt;/li&gt;&lt;/ul&gt;"}]}